#include "stdafx.h"
#include "SpriteExample.h"

/*--------------------------------------------------------------------------------*/
//
//							생성자 부분에서 변수 초기화
//
/*--------------------------------------------------------------------------------*/
SpriteExample::SpriteExample() {
	//사진 경로 설정하고 메모리 할당 하기
	//다음과 같이 가변인자를 받아 텍스쳐를 등록시킨다.
	//아래의 같은 경우 경로는 Texture/First.png 가 된다.
	m_pSprite = new ZeroSprite("Texture/%s.png", "First");
	//사진을 계층트리구조에 등록시킨다 ~
	PushScene(m_pSprite);
}
/*--------------------------------------------------------------------------------*/
//
//										소멸자
//
/*--------------------------------------------------------------------------------*/
SpriteExample::~SpriteExample() {
}
/*--------------------------------------------------------------------------------*/
//
//							Update 함수에서는 기능을 검사
//
/*--------------------------------------------------------------------------------*/
void SpriteExample::Update(float eTime) {
	ZeroIScene::Update(eTime);

}
/*--------------------------------------------------------------------------------*/
//
//							Render함수에서는 그리기만 한다.
//
/*--------------------------------------------------------------------------------*/
void SpriteExample::Render() {
	ZeroIScene::Render();
	//사진 그리기
	m_pSprite->Render();
}
